oe-rv2309/mugen-x86_rc1/logs_failed/fio/oe_test_fio_002/2023-08-28-12_21_23.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Mon Aug 28 12:21:24 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks='sr0 vdb'
+ disk_list=($disks)
+ local_disk=sr0
+ local_disk1=vdb
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmp1rgqjrtt
+ '[' -z '' ']'
+ tmpfile=/tmp/tmp1rgqjrtt
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Mon Aug 28 12:22:55 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Mon Aug 28 12:22:55 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/sr0
+ grep 'items processed'
open: No medium found
+ CHECK_RESULT 1 0 0 'fio-dedupe -o option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -o option failed'
+ LOG_ERROR 'fio-dedupe -o option failed'
+ message='fio-dedupe -o option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -o option failed'
Mon Aug 28 12:22:55 2023 - ERROR - fio-dedupe -o option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 31'
+ message='oe_test_fio_002.sh line 31'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 31'
Mon Aug 28 12:22:55 2023 - ERROR - oe_test_fio_002.sh line 31
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -c 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -c option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -B 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -B option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -p 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -p option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=1980: Mon Aug 28 12:23:08 2023
  write: IOPS=22.5k, BW=87.7MiB/s (92.0MB/s)(1024MiB/11671msec); 0 zone resets
    slat (usec): min=4, max=1398, avg=20.83, stdev=12.82
    clat (usec): min=34, max=4462.8k, avg=689.77, stdev=35084.13
     lat (usec): min=40, max=4462.8k, avg=710.60, stdev=35084.09
    clat percentiles (usec):
     |  1.00th=[   241],  5.00th=[   281], 10.00th=[   297], 20.00th=[   322],
     | 30.00th=[   338], 40.00th=[   355], 50.00th=[   371], 60.00th=[   388],
     | 70.00th=[   412], 80.00th=[   445], 90.00th=[   502], 95.00th=[   537],
     | 99.00th=[   611], 99.50th=[   644], 99.90th=[   832], 99.95th=[  1237],
     | 99.99th=[505414]
   bw (  KiB/s): min=54541, max=179520, per=100.00%, avg=135695.33, stdev=40218.52, samples=15
   iops        : min=13635, max=44880, avg=33924.27, stdev=10054.88, samples=15
  lat (usec)   : 50=0.02%, 100=0.11%, 250=1.29%, 500=88.58%, 750=9.85%
  lat (usec)   : 1000=0.06%
  lat (msec)   : 2=0.04%, 4=0.01%, 20=0.01%, 50=0.01%, 750=0.01%
  lat (msec)   : >=2000=0.01%
  cpu          : usr=5.59%, sys=29.95%, ctx=170043, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=87.7MiB/s (92.0MB/s), 87.7MiB/s-87.7MiB/s (92.0MB/s-92.0MB/s), io=1024MiB (1074MB), run=11671-11671msec

Disk stats (read/write):
  vda: ios=0/260921, merge=0/1309, ticks=0/97780, in_queue=102765, util=99.21%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Mon Aug 28 12:23:10 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 41'
+ message='oe_test_fio_002.sh line 41'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 41'
Mon Aug 28 12:23:10 2023 - ERROR - oe_test_fio_002.sh line 41
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Mon Aug 28 12:23:11 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 43'
+ message='oe_test_fio_002.sh line 43'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 43'
Mon Aug 28 12:23:11 2023 - ERROR - oe_test_fio_002.sh line 43
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=1994: Mon Aug 28 12:23:16 2023
  read: IOPS=206k, BW=3223MiB/s (3380MB/s)(14.6GiB/4654msec)
    clat (usec): min=20, max=280063, avg=138.69, stdev=902.58
     lat (usec): min=20, max=280063, avg=138.84, stdev=902.58
    clat percentiles (usec):
     |  1.00th=[   42],  5.00th=[   61], 10.00th=[   76], 20.00th=[   93],
     | 30.00th=[  104], 40.00th=[  116], 50.00th=[  129], 60.00th=[  145],
     | 70.00th=[  159], 80.00th=[  176], 90.00th=[  194], 95.00th=[  208],
     | 99.00th=[  255], 99.50th=[  285], 99.90th=[  445], 99.95th=[  570],
     | 99.99th=[ 5407]
   bw (  MiB/s): min= 2771, max= 3730, per=100.00%, avg=3281.47, stdev= 9.95, samples=240
   iops        : min=177363, max=238736, avg=210013.50, stdev=636.54, samples=240
  lat (usec)   : 50=2.40%, 100=23.60%, 250=72.89%, 500=1.05%, 750=0.05%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%
  cpu          : usr=1.40%, sys=3.84%, ctx=970539, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3223MiB/s (3380MB/s), 3223MiB/s-3223MiB/s (3380MB/s-3380MB/s), io=14.6GiB (15.7GB), run=4654-4654msec

Disk stats (read/write):
  vdb: ios=943514/0, merge=0/0, ticks=98848/0, in_queue=98848, util=96.62%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Mon Aug 28 12:23:17 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 47'
+ message='oe_test_fio_002.sh line 47'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 47'
Mon Aug 28 12:23:17 2023 - ERROR - oe_test_fio_002.sh line 47
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/sr0,/dev/vdb,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
/usr/bin/genfio: line 280: hostname: command not found
Generating dellr720-day2/-4k,128k,1m-all-write,randwrite,read,randread-sr0,vdb,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Mon Aug 28 12:23:19 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 4
+ test 4 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Mon Aug 28 12:23:19 2023 - ERROR - failed to execute the case.
+ exit 4
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Mon Aug 28 12:23:19 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmp1rgqjrtt ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmp1rgqjrtt
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Mon Aug 28 12:23:23 2023 - INFO  - Finish environment cleanup.